## Plan Result (prod-video-hearings)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-VH-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;HMCTS&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-VH-PROD"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "894e4925-7c39-4297-9c27-7db854753689"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/0d4a44b0-abcf-44ff-80ef-ec139a3a5692"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["HMCTS"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4a0067cc-1de2-4221-b05f-ad14f426f97d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":69,"Program":"tfcmt","SHA1":"","Target":"prod-video-hearings","Vars":{}} -->